# Task #1
# Створити програму, яка буде отримувати від користувача назву тварини.
# В залежності від введеної тварини, виводити в консоль звук, який ця тварина видає.
# Вивід має бути у такому форматі - "Назва_тварини говорить - звук_тварини". Назва тварини має починатись з великої літери.
# Якщо була введена назва тварини, яка не покривається програмою (або щось ліве), то вивести в консоль відповідне повідомлення.
# Програма має покривати 4-5 назв тварин, в незалежності від регістру введених назв.
#
# Приклад взаємодії користувача з цією програмою:    |   Приклад взаємодії користувача з цією програмою:
# Введіть назву тварини:                             |   Введіть назву тварини:
# супер_вЕдміДь                                      |   сУпер_веДмідь
# Супер_ведмідь говорить - ведмежачий звук           |   Супер_ведмідь говорить - ведмежачий звук

puts 'Please, enter a name of the animal'
arr = ['Super_bear' => 'bear sound', 'Super_wolf' => 'wolf sound', 'Super_chicken' => 'chicken sound']
name = gets.chomp
if name == 'Super_bear'
    puts "#{name} says - bear sound"
elsif name == 'Super_wolf'
    puts "#{name} says - wolf sound"
elsif name == 'Super_chicken'
    puts "#{name} says - chicken sound"
elsif name == 'Super_dog'
    puts "#{name} says - dog sound"
end